# PYTHON-8. Очистка данных

- Сколько раз клиенту нужно прийти в контору, чтобы сделать ставку?
- Каков средний выигрыш в процентах?
- Каков баланс по каждому пользователю?
- Какие города самые выгодные?
- В каких городах самая высокая ставка
- Сколько времени проходит от первого посещения клиентом сайта до первой ставки?

In [13]:
import pandas as pd 


# Загрузим "log.csv" в dataframe log с помощью read_csv. 
# Не передавайте никаких дополнительных параметров!

# В результате переменная log должна содержать загруженный из 
# файла датафрейм. Напишите код загрузки

log = pd.read_csv('./datasets/python-8/log.csv')

Предобработка состоит из следующих этапов:

- Загрузка.
- Очистка.
- Обогащение / feature engineering.
- Анализ.

In [23]:
import pandas as pd

log = pd.read_csv('./datasets/python-8/log.csv', header = None)
log

                                    0                     1        2        3
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [103]:
sample = pd.read_csv('./datasets/python-8/sample.csv')
columns = sample.columns

sample.columns = [s.lower() for s in columns]
display(sample)

sample = pd.read_csv('./datasets/python-8/sample.csv')
sample.columns = map(lambda x: str(x).lower(), sample.columns)
display(sample)

            name         city  age profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

            name         city  age profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [37]:
log = pd.read_csv("./datasets/python-8/log.csv", header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log

                              user_id                  time      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [46]:
import pandas as pd


users = pd.read_csv('./datasets/python-8/users.csv', encoding='koi8_r', sep='\t')
users.columns = ['user_id', 'email', 'geo']
users

     user_id                     email          geo
0   User_943       Accumanst@gmail.com       Ижевск
1   User_908         Advismowr@mail.ru       Ижевск
2   User_962           Anachso@ukr.net    Краснодар
3   User_973          Antecia@inbox.ru        Пермь
4   User_902        Balliaryva@ukr.net          NaN
..       ...                       ...          ...
95  User_959  UpdatesCurious@yahoo.com       Тюмень
96  User_901        V2artierso@mail.ru  Арзангелтск
97  User_970          Vashoterlo@bk.ru      Воронеж
98  User_965       Visuareda@yahoo.com      Воронеж
99  User_921              Aavast@ya.ru       Ижевск

[100 rows x 3 columns]

In [56]:
users.info()
log.info()
sample.info()

display(
    users.head(2),
    log.head(2),
    users.user_id.unique(), log.user_id.unique(),
)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  100 non-null    object
 1   email    99 non-null     object
 2   geo      97 non-null     object
dtypes: object(3)
memory usage: 2.5+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  1000 non-null   object
 1   time     985 non-null    object
 2   bet      485 non-null    float64
 3   win      138 non-null    float64
dtypes: float64(2), object(2)
memory usage: 31.4+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   city        10 non-null     object
 2   age         11 non-null     int64
 3   profession  11 non-null     object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

    user_id                email     geo
0  User_943  Accumanst@gmail.com  Ижевск
1  User_908    Advismowr@mail.ru  Ижевск

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN

array(['User_943', 'User_908', 'User_962', 'User_973', 'User_902',
       'User_976', 'User_955', 'User_992', 'User_978', 'User_939',
       'User_974', 'User_983', 'User_932', 'User_903', 'User_954',
       'User_918', 'User_906', 'User_941', 'User_917', 'User_947',
       'User_919', 'User_1000', 'User_998', 'User_949', 'User_946',
       'User_938', 'User_934', 'User_916', 'User_989', 'User_935',
       'User_966', 'User_928', 'User_985', 'User_960', 'User_950',
       'User_910', 'User_977', 'User_961', 'User_967', 'User_972',
       'User_957', 'User_993', 'User_991', 'User_911', 'User_931',
       'User_980', 'User_952', 'User_990', 'User_912', 'User_913',
       'User_984', 'User_969', 'User_904', 'User_953', 'User_995',
       'User_951', 'User_900', 'User_930', 'User_922', 'User_926',
       'User_982', 'User_942', 'User_958', 'User_975', 'User_933',
       'User_987', 'User_920', 'User_964', 'User_937', 'User_927',
       'User_936', 'User_905', 'User_986', 'User_915', 'User_997',
       'User_971', 'User_909', 'User_963', 'User_948', 'User_914',
       'User_968', 'User_944', 'User_924', 'User_925', 'User_940',
       'User_988', 'User_999', 'User_981', 'User_923', 'User_945',
       'User_979', 'User_994', 'User_929', 'User_907', 'User_996',
       'User_959', 'User_901', 'User_970', 'User_965', 'User_921'],
      dtype=object)

array(['Запись пользователя № - user_919',
       'Запись пользователя № - user_973',
       'Запись пользователя № - user_903',
       'Запись пользователя № - user_954',
       'Запись пользователя № - user_917',
       'Запись пользователя № - user_900',
       'Запись пользователя № - user_980',
       'Запись пользователя № - user_906',
       'Запись пользователя № - user_952',
       'Запись пользователя № - user_972',
       'Запись пользователя № - user_966',
       'Запись пользователя № - user_964',
       'Запись пользователя № - user_978',
       'Запись пользователя № - user_968',
       'Запись пользователя № - user_974',
       'Запись пользователя № - user_998',
       'Запись пользователя № - user_990',
       'Запись пользователя № - user_942',
       'Запись пользователя № - user_929',
       'Запись пользователя № - user_976',
       'Запись пользователя № - user_927',
       'Запись пользователя № - user_951',
       'Запись пользователя № - user_949',
       'Запись пользователя № - user_987',
       'Запись пользователя № - user_985',
       'Запись пользователя № - user_992',
       'Запись пользователя № - user_937',
       'Запись пользователя № - user_913',
       'Запись пользователя № - user_948',
       'Запись пользователя № - user_916',
       'Запись пользователя № - user_938',
       'Запись пользователя № - user_997',
       'Запись пользователя № - user_940',
       'Запись пользователя № - user_918',
       'Запись пользователя № - user_960',
       'Запись пользователя № - user_905',
       'Запись пользователя № - user_924',
       'Запись пользователя № - user_958',
       'Запись пользователя № - user_920',
       'Запись пользователя № - user_943',
       'Запись пользователя № - user_935',
       'Запись пользователя № - user_915',
       'Запись пользователя № - user_921',
       'Запись пользователя № - user_999',
       'Запись пользователя № - user_982',
       'Запись пользователя № - user_928',
       'Запись пользователя № - user_944',
       'Запись пользователя № - user_912',
       'Запись пользователя № - user_969',
       'Запись пользователя № - user_901',
       'Запись пользователя № - user_995',
       'Запись пользователя № - user_933',
       'Запись пользователя № - user_986',
       'Запись пользователя № - user_971',
       'Запись пользователя № - user_977',
       'Запись пользователя № - user_979',
       'Запись пользователя № - user_910',
       'Запись пользователя № - user_994',
       'Запись пользователя № - user_907',
       'Запись пользователя № - user_941',
       'Запись пользователя № - user_989',
       'Запись пользователя № - user_955',
       'Запись пользователя № - user_991',
       'Запись пользователя № - user_996',
       'Запись пользователя № - user_926',
       'Запись пользователя № - user_984',
       'Запись пользователя № - user_957',
       'Запись пользователя № - user_914',
       'Запись пользователя № - user_988',
       'Запись пользователя № - user_923',
       'Запись пользователя № - user_967',
       'Запись пользователя № - user_945',
       'Запись пользователя № - user_993',
       'Запись пользователя № - user_908',
       'Запись пользователя № - user_930',
       'Запись пользователя № - user_981',
       'Запись пользователя № - user_936',
       'Запись пользователя № - user_922',
       'Запись пользователя № - user_962',
       'Запись пользователя № - user_965',
       'Запись пользователя № - user_959',
       'Запись пользователя № - user_963',
       'Запись пользователя № - user_904',
       'Запись пользователя № - user_931',
       'Запись пользователя № - user_1000',
       'Запись пользователя № - user_946',
       'Запись пользователя № - user_970',
       'Запись пользователя № - user_939',
       'Запись пользователя № - user_961',
       'Запись пользователя № - user_911',
       'Запись пользователя № - user_950',
       'Запись пользователя № - user_956',
       'Запись пользователя № - user_909',
       'Запись пользователя № - user_983',
       'Запись пользователя № - user_902',
       'Запись пользователя № - user_947',
       'Запись пользователя № - user_975',
       'Запись пользователя № - user_953',
       'Запись пользователя № - user_925',
       'Запись пользователя № - user_934',
       'Запись пользователя № - user_932', '#error'], dtype=object)

In [58]:
sample.name.unique()

array(['Иванов', nan, 'sidorov', '_______', 'Кузнецов', 'Сажин',
       'Котлеревский', 'Завалишина', 'Левина', 'Фикс'], dtype=object)

In [66]:
sample.info()
len(sample.city.unique())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   city        10 non-null     object
 2   age         11 non-null     int64
 3   profession  11 non-null     object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

10

In [68]:
log.user_id.unique()

array(['Запись пользователя № - user_919',
       'Запись пользователя № - user_973',
       'Запись пользователя № - user_903',
       'Запись пользователя № - user_954',
       'Запись пользователя № - user_917',
       'Запись пользователя № - user_900',
       'Запись пользователя № - user_980',
       'Запись пользователя № - user_906',
       'Запись пользователя № - user_952',
       'Запись пользователя № - user_972',
       'Запись пользователя № - user_966',
       'Запись пользователя № - user_964',
       'Запись пользователя № - user_978',
       'Запись пользователя № - user_968',
       'Запись пользователя № - user_974',
       'Запись пользователя № - user_998',
       'Запись пользователя № - user_990',
       'Запись пользователя № - user_942',
       'Запись пользователя № - user_929',
       'Запись пользователя № - user_976',
       'Запись пользователя № - user_927',
       'Запись пользователя № - user_951',
       'Запись пользователя № - user_949',
       'Запись пользователя № - user_987',
       'Запись пользователя № - user_985',
       'Запись пользователя № - user_992',
       'Запись пользователя № - user_937',
       'Запись пользователя № - user_913',
       'Запись пользователя № - user_948',
       'Запись пользователя № - user_916',
       'Запись пользователя № - user_938',
       'Запись пользователя № - user_997',
       'Запись пользователя № - user_940',
       'Запись пользователя № - user_918',
       'Запись пользователя № - user_960',
       'Запись пользователя № - user_905',
       'Запись пользователя № - user_924',
       'Запись пользователя № - user_958',
       'Запись пользователя № - user_920',
       'Запись пользователя № - user_943',
       'Запись пользователя № - user_935',
       'Запись пользователя № - user_915',
       'Запись пользователя № - user_921',
       'Запись пользователя № - user_999',
       'Запись пользователя № - user_982',
       'Запись пользователя № - user_928',
       'Запись пользователя № - user_944',
       'Запись пользователя № - user_912',
       'Запись пользователя № - user_969',
       'Запись пользователя № - user_901',
       'Запись пользователя № - user_995',
       'Запись пользователя № - user_933',
       'Запись пользователя № - user_986',
       'Запись пользователя № - user_971',
       'Запись пользователя № - user_977',
       'Запись пользователя № - user_979',
       'Запись пользователя № - user_910',
       'Запись пользователя № - user_994',
       'Запись пользователя № - user_907',
       'Запись пользователя № - user_941',
       'Запись пользователя № - user_989',
       'Запись пользователя № - user_955',
       'Запись пользователя № - user_991',
       'Запись пользователя № - user_996',
       'Запись пользователя № - user_926',
       'Запись пользователя № - user_984',
       'Запись пользователя № - user_957',
       'Запись пользователя № - user_914',
       'Запись пользователя № - user_988',
       'Запись пользователя № - user_923',
       'Запись пользователя № - user_967',
       'Запись пользователя № - user_945',
       'Запись пользователя № - user_993',
       'Запись пользователя № - user_908',
       'Запись пользователя № - user_930',
       'Запись пользователя № - user_981',
       'Запись пользователя № - user_936',
       'Запись пользователя № - user_922',
       'Запись пользователя № - user_962',
       'Запись пользователя № - user_965',
       'Запись пользователя № - user_959',
       'Запись пользователя № - user_963',
       'Запись пользователя № - user_904',
       'Запись пользователя № - user_931',
       'Запись пользователя № - user_1000',
       'Запись пользователя № - user_946',
       'Запись пользователя № - user_970',
       'Запись пользователя № - user_939',
       'Запись пользователя № - user_961',
       'Запись пользователя № - user_911',
       'Запись пользователя № - user_950',
       'Запись пользователя № - user_956',
       'Запись пользователя № - user_909',
       'Запись пользователя № - user_983',
       'Запись пользователя № - user_902',
       'Запись пользователя № - user_947',
       'Запись пользователя № - user_975',
       'Запись пользователя № - user_953',
       'Запись пользователя № - user_925',
       'Запись пользователя № - user_934',
       'Запись пользователя № - user_932', '#error'], dtype=object)

In [80]:
# Создайте новый датафрейм sample2, в который будут входить 
# только записи о людях в возрасте меньше 30 лет.
import pandas as pd 

sample = pd.read_csv("datasets/python-8/sample.csv")
sample.head()

sample2 = sample[sample.Age < 30]
sample2

       Name    City  Age Profession
0    Иванов  Москва   25     Клинер
2    Иванов  Москва   25     Клинер
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [127]:
# Создайте новый датафрейм log_win, в который будут входить только записи, 
# где пользователь выиграл. Посчитайте, сколько таких записей, и сохраните в переменной win_count.

log = pd.read_csv("datasets/python-8/log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
display(len(log))

log_win = log[~(log.win.isnull())]
display(len(log_win))

log_win = log[log.win.notna()]
display(len(log_win))

log_win = log[~log.win.isna()]
display(len(log_win))


log_win = log[log.win.notna()]
win_count = len(log_win)

1000

138

138

138

In [141]:
sample = pd.read_csv("datasets/python-8/sample.csv")


sample2 = sample[sample.Age < 30]

sample2

       Name    City  Age Profession
0    Иванов  Москва   25     Клинер
2    Иванов  Москва   25     Клинер
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [143]:
sample.query('Age>20')

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [144]:
sample.query('Age==25')

     Name    City  Age Profession
0  Иванов  Москва   25     Клинер
2  Иванов  Москва   25     Клинер

In [146]:
sample.query('City in ["Рига","Сочи"]')

        Name  City  Age Profession
5   Кузнецов  Сочи   19    Рабочий
10      Фикс  Рига   42    Рабочий

In [148]:
sample.query('City in ["Рига", "Сочи","Чебоксары", "Сургут"] & 21<Age<50 & Profession!="Менеджер"')

     Name    City  Age Profession
6   Сажин  Сургут   29    Рабочий
10   Фикс    Рига   42    Рабочий

In [153]:
# С помощью функции query найдите тех, у кого ставка меньше 2000, а выигрыш больше 0. 
# Сохраните в новый датафрейм log2.
import pandas as pd 


log = pd.read_csv("datasets/python-8/log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
# Напишите ваш код ниже
log2 = log.query('bet < 2000 & win > 0')

In [165]:
# Найдите записи, где в городах есть буква «о», и сохраните в переменную sample3.
# Функция contains не может работать с пустыми значениями: необходимо использовать параметр na = False

sample = pd.read_csv("datasets/python-8/sample.csv")
display(sample.City.unique())
sample3 = sample[sample.City.str.contains('о', na = False)]

# Найдите записи, где в городах нет буквы "о", и сохраните в переменную sample4. 
# Не забудьте про NaN и параметр na
sample4 = sample[~sample.City.str.contains('о', na = False)]
sample4

array(['Москва', 'Волгоград', 'Владивосток', 'Курск', 'Сочи', 'Сургут',
       'Йошкар-Ола', 'Чебоксары', nan, 'Рига'], dtype=object)

       Name    City  Age Profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

In [170]:
# Сохраните в переменную new_log датафрейм, из которого удалены записи с ошибкой в поле user_id:


log.user_id.unique()
new_log = log[~log.user_id.str.contains('error', na = False)]
new_log.user_id.unique()

array(['Запись пользователя № - user_919',
       'Запись пользователя № - user_973',
       'Запись пользователя № - user_903',
       'Запись пользователя № - user_954',
       'Запись пользователя № - user_917',
       'Запись пользователя № - user_900',
       'Запись пользователя № - user_980',
       'Запись пользователя № - user_906',
       'Запись пользователя № - user_952',
       'Запись пользователя № - user_972',
       'Запись пользователя № - user_966',
       'Запись пользователя № - user_964',
       'Запись пользователя № - user_978',
       'Запись пользователя № - user_968',
       'Запись пользователя № - user_974',
       'Запись пользователя № - user_998',
       'Запись пользователя № - user_990',
       'Запись пользователя № - user_942',
       'Запись пользователя № - user_929',
       'Запись пользователя № - user_976',
       'Запись пользователя № - user_927',
       'Запись пользователя № - user_951',
       'Запись пользователя № - user_949',
       'Запись пользователя № - user_987',
       'Запись пользователя № - user_985',
       'Запись пользователя № - user_992',
       'Запись пользователя № - user_937',
       'Запись пользователя № - user_913',
       'Запись пользователя № - user_948',
       'Запись пользователя № - user_916',
       'Запись пользователя № - user_938',
       'Запись пользователя № - user_997',
       'Запись пользователя № - user_940',
       'Запись пользователя № - user_918',
       'Запись пользователя № - user_960',
       'Запись пользователя № - user_905',
       'Запись пользователя № - user_924',
       'Запись пользователя № - user_958',
       'Запись пользователя № - user_920',
       'Запись пользователя № - user_943',
       'Запись пользователя № - user_935',
       'Запись пользователя № - user_915',
       'Запись пользователя № - user_921',
       'Запись пользователя № - user_999',
       'Запись пользователя № - user_982',
       'Запись пользователя № - user_928',
       'Запись пользователя № - user_944',
       'Запись пользователя № - user_912',
       'Запись пользователя № - user_969',
       'Запись пользователя № - user_901',
       'Запись пользователя № - user_995',
       'Запись пользователя № - user_933',
       'Запись пользователя № - user_986',
       'Запись пользователя № - user_971',
       'Запись пользователя № - user_977',
       'Запись пользователя № - user_979',
       'Запись пользователя № - user_910',
       'Запись пользователя № - user_994',
       'Запись пользователя № - user_907',
       'Запись пользователя № - user_941',
       'Запись пользователя № - user_989',
       'Запись пользователя № - user_955',
       'Запись пользователя № - user_991',
       'Запись пользователя № - user_996',
       'Запись пользователя № - user_926',
       'Запись пользователя № - user_984',
       'Запись пользователя № - user_957',
       'Запись пользователя № - user_914',
       'Запись пользователя № - user_988',
       'Запись пользователя № - user_923',
       'Запись пользователя № - user_967',
       'Запись пользователя № - user_945',
       'Запись пользователя № - user_993',
       'Запись пользователя № - user_908',
       'Запись пользователя № - user_930',
       'Запись пользователя № - user_981',
       'Запись пользователя № - user_936',
       'Запись пользователя № - user_922',
       'Запись пользователя № - user_962',
       'Запись пользователя № - user_965',
       'Запись пользователя № - user_959',
       'Запись пользователя № - user_963',
       'Запись пользователя № - user_904',
       'Запись пользователя № - user_931',
       'Запись пользователя № - user_1000',
       'Запись пользователя № - user_946',
       'Запись пользователя № - user_970',
       'Запись пользователя № - user_939',
       'Запись пользователя № - user_961',
       'Запись пользователя № - user_911',
       'Запись пользователя № - user_950',
       'Запись пользователя № - user_956',
       'Запись пользователя № - user_909',
       'Запись пользователя № - user_983',
       'Запись пользователя № - user_902',
       'Запись пользователя № - user_947',
       'Запись пользователя № - user_975',
       'Запись пользователя № - user_953',
       'Запись пользователя № - user_925',
       'Запись пользователя № - user_934',
       'Запись пользователя № - user_932'], dtype=object)

In [189]:
sample.Age.apply(lambda x:x**2)

# С помощью apply и лямбда-функции увеличьте возраст во всех записях на 1 год и сохраните в sample2. 
# В переменной sample2 должен содержаться весь датафрейм sample.
import pandas as pd 

sample = pd.read_csv("datasets/python-8/sample.csv")
sample.head()

sample2 = sample.copy()
sample2.Age = sample2.Age.apply(lambda x: x+1)

In [192]:
# С помощью apply и lambda-функции замените все буквы в поле City на маленькие и сохраните в sample2. 
# Вам может понадобиться функция s.lower().
# Обратите внимание: когда в столбце есть пропущенные значения, необходимо в явном виде указывать, 
# что это str.

sample2 = sample.copy()
sample2.City = sample.City.apply(lambda x: str(x).lower())

sample.City.unique()

array(['москва', 'волгоград', 'владивосток', 'курск', 'сочи', 'сургут',
       'йошкар-ола', 'чебоксары', 'nan', 'рига'], dtype=object)

In [201]:
import pandas as pd 

sample = pd.read_csv("datasets/python-8/sample.csv")

# Напишите функцию profession_code, которая на вход получает строку, а на выход возвращает:
# 
# 0 — если на вход поступила строка "Рабочий"
# 1 — если на вход поступила строка "Менеджер"
# 2 — в любом другом случае

def profession_code(s: str) -> int:
    if s == 'Рабочий':
        return 0
    elif s == 'Менеджер':
        return 1
    else:
        return 2
        
sample2 = sample.copy()

sample2.Profession = sample.Profession.apply(profession_code)
sample2

            Name         City  Age  Profession
0         Иванов       Москва   25           2
1            NaN    Волгоград   31           1
2         Иванов       Москва   25           2
3        sidorov  Владивосток   43           1
4        _______        Курск   50           2
5       Кузнецов         Сочи   19           0
6          Сажин       Сургут   29           0
7   Котлеревский   Йошкар-Ола   32           0
8     Завалишина    Чебоксары   36           1
9         Левина          NaN   55           0
10          Фикс         Рига   42           0

In [203]:
import pandas as pd 

sample = pd.read_csv("datasets/python-8/sample.csv")

# Напишите функцию age_category, которая на вход получает число, а на выход отдаёт:
# 
# "молодой" — если возраст меньше 23
# "средний" — если возраст от 23 до 35
# "зрелый" — если возраст больше 35

def age_category(age):
    if age < 23:
        return 'молодой'
    elif 23 < age < 35:
        return 'средний'
    else:
        return 'зрелый'
    

# Примените функцию age_category и apply, чтобы создать новую колонку в sample 
# под названием 'Age_category'. Не забудьте загрузить датафрейм.

# Вспомним, как создать новую колонку:
# df['new_column'] = df.old_column.apply(func)
sample['Age_category'] = sample.Age.apply(age_category)
sample

            Name         City  Age Profession Age_category
0         Иванов       Москва   25     Клинер      средний
1            NaN    Волгоград   31   Менеджер      средний
2         Иванов       Москва   25     Клинер      средний
3        sidorov  Владивосток   43   Менеджер       зрелый
4        _______        Курск   50   Водитель       зрелый
5       Кузнецов         Сочи   19    Рабочий      молодой
6          Сажин       Сургут   29    Рабочий      средний
7   Котлеревский   Йошкар-Ола   32    Рабочий      средний
8     Завалишина    Чебоксары   36   Менеджер       зрелый
9         Левина          NaN   55    Рабочий       зрелый
10          Фикс         Рига   42    Рабочий       зрелый

In [214]:
# Преобразуем поле user_id в датафрейме log, оставив только идентификатор пользователя.
# Например, вместо "Запись пользователя № — user_974" должно остаться только "user_974".

# На месте записей с ошибками в user_id должна быть пустая строка "". 
# Сделайте это через apply и новую функцию, которую вы создадите. Результат сохраните в log:

import pandas as pd 


log = pd.read_csv("datasets/python-8/log.csv", header=None)
log.columns = ['user_id','time','bet','win']

def repair_user_id(field):
    return ("" if 'error' in field 
            else field.split()[-1])

log.user_id = log.user_id.apply(repair_user_id)

In [231]:
# Загрузите log.csv в log. Удалите квадратную скобку из первой строки в столбце time, 
# чтобы привести его к более привычному формату: t равен log.time[0]. Сохраните результат в t:
import pandas as pd 


log = pd.read_csv("datasets/python-8/log.csv", header=None)
log.columns = ['user_id','time','bet','win']
t = log.time[0]
t = t[1:]

# Уберите ненужную скобку "[" из поля в time. Результат сохраните в log:
log.time = log.time.str.replace('[', '')
# log.time.unique()

array(['2019-01-01 14:06:51', '2019-01-01 14:51:16',
       '2019-01-01 16:31:16', '2019-01-01 17:17:51',
       '2019-01-01 21:31:18', '2019-01-01 23:34:55', '2019-01-01 4:37:25',
       '2019-01-01 6:31:23', '2019-01-02 10:57:08', '2019-01-02 16:55:06',
       '2019-01-02 20:47:54', '2019-01-02 21:32:20',
       '2019-01-02 21:32:35', '2019-01-02 5:25:40', '2019-01-02 8:57:36',
       '2019-01-02 9:32:24', '2019-01-03 10:43:41', '2019-01-03 11:29:08',
       '2019-01-03 13:12:46', '2019-01-03 14:03:21',
       '2019-01-03 17:20:23', '2019-01-03 18:24:25',
       '2019-01-03 18:45:54', '2019-01-03 2:48:25', '2019-01-03 5:30:43',
       '2019-01-03 5:49:42', '2019-01-04 1:59:34', '2019-01-04 11:50:21',
       '2019-01-04 12:49:31', '2019-01-04 13:59:42',
       '2019-01-04 15:07:26', '2019-01-04 17:05:30',
       '2019-01-04 18:21:37', '2019-01-04 19:22:43', '2019-01-04 2:59:24',
       '2019-01-04 21:52:08', '2019-01-04 23:16:33', '2019-01-04 4:00:52',
       '2019-01-04 5:40:14', '2019-01-05 1:54:07', '2019-01-05 10:44:56',
       '2019-01-05 13:13:21', '2019-01-05 14:36:15',
       '2019-01-05 18:09:15', '2019-01-05 20:55:29', '2019-01-05 3:50:10',
       '2019-01-05 3:56:22', '2019-01-05 4:36:52', '2019-01-05 5:11:21',
       '2019-01-05 6:06:11', '2019-01-05 7:33:05', '2019-01-06 18:19:59',
       '2019-01-06 18:45:28', '2019-01-06 20:33:50',
       '2019-01-06 21:06:57', '2019-01-06 3:21:56', '2019-01-06 8:10:06',
       '2019-01-06 9:33:18', '2019-01-07 0:23:47', '2019-01-07 1:05:59',
       '2019-01-07 10:07:52', '2019-01-07 13:24:18',
       '2019-01-07 14:57:44', '2019-01-07 15:38:24',
       '2019-01-07 18:18:38', '2019-01-07 19:45:03', '2019-01-07 2:59:32',
       '2019-01-07 21:46:13', '2019-01-07 5:50:28', '2019-01-07 7:04:23',
       '2019-01-07 8:45:59', '2019-01-07 9:56:20', '2019-01-08 0:41:58',
       '2019-01-08 1:03:26', '2019-01-08 1:22:31', '2019-01-08 10:14:31',
       '2019-01-08 11:38:06', '2019-01-08 13:06:25',
       '2019-01-08 14:43:12', '2019-01-08 2:22:29', '2019-01-08 20:05:23',
       '2019-01-08 21:14:57', '2019-01-08 21:21:14', '2019-01-08 3:37:48',
       '2019-01-08 6:56:25', '2019-01-08 6:58:19', '2019-01-09 10:10:50',
       '2019-01-09 17:43:11', '2019-01-09 17:50:56',
       '2019-01-09 17:53:01', '2019-01-09 20:18:14', '2019-01-09 3:05:07',
       '2019-01-09 3:05:33', '2019-01-10 0:41:05', '2019-01-10 1:44:39',
       '2019-01-10 12:16:22', '2019-01-10 15:17:48',
       '2019-01-10 18:36:02', '2019-01-10 2:17:43', '2019-01-10 3:55:38',
       '2019-01-10 6:34:42', '2019-01-10 7:32:17', '2019-01-11 13:07:41',
       '2019-01-11 13:43:37', '2019-01-11 15:01:53',
       '2019-01-11 20:06:17', '2019-01-11 6:27:50', '2019-01-11 6:33:57',
       '2019-01-11 7:48:01', '2019-01-11 8:31:04', '2019-01-11 8:52:01',
       '2019-01-12 0:24:04', '2019-01-12 0:41:00', '2019-01-12 11:35:22',
       '2019-01-12 13:25:30', '2019-01-12 14:29:19',
       '2019-01-12 15:30:11', '2019-01-12 18:48:09',
       '2019-01-12 22:04:43', '2019-01-12 22:14:13',
       '2019-01-12 22:23:14', '2019-01-12 4:50:34', '2019-01-12 8:55:52',
       '2019-01-13 0:45:59', '2019-01-13 13:51:26', '2019-01-13 14:43:36',
       '2019-01-13 18:06:57', '2019-01-13 22:39:26', '2019-01-13 4:21:02',
       '2019-01-13 5:03:30', '2019-01-14 1:14:30', '2019-01-14 10:38:33',
       '2019-01-14 11:31:43', '2019-01-14 12:56:34',
       '2019-01-14 13:14:58', '2019-01-14 20:00:42', '2019-01-14 4:49:23',
       '2019-01-15 1:16:06', '2019-01-15 1:50:50', '2019-01-15 15:43:02',
       '2019-01-15 16:40:58', '2019-01-15 17:04:00',
       '2019-01-15 18:13:14', '2019-01-15 2:01:38', '2019-01-15 20:34:36',
       '2019-01-15 22:44:59', '2019-01-15 7:56:32', '2019-01-16 1:00:44',
       '2019-01-16 14:29:37', '2019-01-16 14:51:36',
       '2019-01-16 19:58:56', '2019-01-16 21:54:22', '2019-01-16 4:08:49',
       '2019-01-16 5:51:25', '2019-01-16 6:04:59', '2019-01-17 1:45:02',
       '2019-01-17 16:10:18', '2019-01-17 16:46:52', '2019-01-17 2:39:35',
       '2019-01-17 3:30:38', '2019-01-17 9:10:37', '2019-01-17 9:58:09',
       '2019-01-18 14:44:47', '2019-01-18 15:20:12',
       '2019-01-18 21:36:48', '2019-01-18 21:57:07',
       '2019-01-18 23:10:15', '2019-01-18 3:18:35', '2019-01-18 9:50:48',
       '2019-01-19 15:33:22', '2019-01-19 17:50:09',
       '2019-01-19 18:58:50', '2019-01-19 19:57:19', '2019-01-19 2:12:47',
       '2019-01-19 2:29:51', '2019-01-19 7:21:13', '2019-01-19 9:17:35',
       '2019-01-20 0:17:00', '2019-01-20 1:16:09', '2019-01-20 13:51:48',
       '2019-01-20 13:57:39', '2019-01-20 19:20:49',
       '2019-01-20 20:12:03', '2019-01-20 3:06:35', '2019-01-20 7:07:43',
       '2019-01-20 9:43:39', '2019-01-21 0:25:16', '2019-01-21 0:29:43',
       '2019-01-21 10:51:52', '2019-01-21 18:34:44',
       '2019-01-21 19:03:25', '2019-01-21 19:31:34',
       '2019-01-21 21:15:46', '2019-01-21 23:31:36', '2019-01-21 4:53:07',
       '2019-01-21 5:07:36', '2019-01-21 5:35:47', '2019-01-21 8:10:48',
       '2019-01-21 8:12:58', '2019-01-21 8:49:20', '2019-01-22 16:09:06',
       '2019-01-22 2:45:39', '2019-01-22 3:32:22', '2019-01-22 4:05:55',
       '2019-01-22 4:51:27', '2019-01-22 5:26:59', '2019-01-22 7:15:00',
       '2019-01-22 7:58:34', '2019-01-22 9:31:52', '2019-01-23 16:58:18',
       '2019-01-23 18:20:59', '2019-01-23 18:47:21', '2019-01-23 2:43:22',
       '2019-01-23 21:04:30', '2019-01-23 3:40:49', '2019-01-23 5:49:28',
       '2019-01-24 12:57:32', '2019-01-24 15:28:13',
       '2019-01-24 21:12:22', '2019-01-24 23:16:50', '2019-01-24 5:03:17',
       '2019-01-24 7:45:40', '2019-01-24 8:40:53', '2019-01-24 9:48:17',
       '2019-01-25 1:32:17', '2019-01-25 11:19:28', '2019-01-25 12:45:46',
       '2019-01-25 15:38:34', '2019-01-25 17:02:53',
       '2019-01-25 17:35:05', '2019-01-25 2:42:00', '2019-01-25 3:13:57',
       '2019-01-25 8:57:20', '2019-01-26 0:23:22', '2019-01-26 1:14:55',
       '2019-01-26 10:41:06', '2019-01-26 11:16:27',
       '2019-01-26 11:54:29', '2019-01-26 13:30:56',
       '2019-01-26 16:02:16', '2019-01-26 19:56:31',
       '2019-01-26 20:28:23', '2019-01-26 6:21:10', '2019-01-26 6:21:38',
       '2019-01-26 6:54:11', '2019-01-26 8:38:34', '2019-01-27 1:18:47',
       '2019-01-27 1:54:59', '2019-01-27 18:14:22', '2019-01-27 2:32:21',
       '2019-01-27 20:54:28', '2019-01-27 3:23:22', '2019-01-27 5:39:56',
       '2019-01-27 9:57:23', '2019-01-28 0:35:40', '2019-01-28 11:14:56',
       '2019-01-28 11:27:42', '2019-01-28 16:49:12',
       '2019-01-28 17:05:59', '2019-01-28 17:37:11',
       '2019-01-28 20:57:37', '2019-01-28 22:46:50', '2019-01-28 3:12:06',
       '2019-01-29 1:34:05', '2019-01-29 10:08:23', '2019-01-29 10:37:55',
       '2019-01-29 10:47:06', '2019-01-29 12:50:05',
       '2019-01-29 16:12:03', '2019-01-29 18:31:27',
       '2019-01-29 19:54:38', '2019-01-29 2:33:38', '2019-01-29 2:59:37',
       '2019-01-29 4:33:47', '2019-01-29 5:48:05', '2019-01-29 8:29:54',
       '2019-01-30 10:06:00', '2019-01-30 12:50:45',
       '2019-01-30 12:58:07', '2019-01-30 9:18:01', '2019-01-31 10:21:33',
       '2019-01-31 13:31:52', '2019-01-31 14:46:03',
       '2019-01-31 16:56:24', '2019-01-31 2:25:43', '2019-01-31 22:50:11',
       '2019-01-31 3:07:14', '2019-01-31 3:21:57', '2019-01-31 4:57:32',
       '2019-01-31 6:29:53', '2019-01-31 7:16:14', '2019-01-31 9:15:44',
       '2019-02-01 15:13:13', '2019-02-01 15:17:22',
       '2019-02-02 12:34:44', '2019-02-02 15:28:36',
       '2019-02-02 17:17:43', '2019-02-02 18:53:20',
       '2019-02-02 22:15:10', '2019-02-02 6:01:13', '2019-02-02 6:15:01',
       '2019-02-02 9:09:54', '2019-02-03 12:39:58', '2019-02-03 14:27:44',
       '2019-02-03 16:03:23', '2019-02-03 2:24:23', '2019-02-03 2:52:28',
       '2019-02-03 22:14:22', '2019-02-03 4:15:12', '2019-02-04 0:28:07',
       '2019-02-04 11:51:46', '2019-02-04 13:58:06',
       '2019-02-04 15:03:23', '2019-02-04 6:23:34', '2019-02-05 10:41:57',
       '2019-02-05 13:00:43', '2019-02-05 13:39:37',
       '2019-02-05 14:08:57', '2019-02-05 14:33:44',
       '2019-02-05 16:33:46', '2019-02-05 17:09:37',
       '2019-02-05 17:33:39', '2019-02-05 18:14:18',
       '2019-02-05 19:40:52', '2019-02-05 21:16:53',
       '2019-02-05 21:48:02', '2019-02-05 23:21:07',
       '2019-02-05 23:40:17', '2019-02-05 8:34:25', '2019-02-06 0:18:15',
       '2019-02-06 1:47:41', '2019-02-06 10:33:49', '2019-02-06 13:49:28',
       '2019-02-06 15:06:37', '2019-02-06 18:13:08',
       '2019-02-06 22:54:50', '2019-02-06 3:40:40', '2019-02-06 5:49:12',
       '2019-02-06 5:55:23', '2019-02-07 0:02:52', '2019-02-07 1:39:16',
       '2019-02-07 13:28:06', '2019-02-07 17:27:13',
       '2019-02-07 20:53:58', '2019-02-07 22:36:18', '2019-02-07 3:18:17',
       '2019-02-08 0:48:07', '2019-02-08 10:27:06', '2019-02-08 10:36:47',
       '2019-02-08 11:06:00', '2019-02-08 13:27:54',
       '2019-02-08 13:42:30', '2019-02-08 20:39:06',
       '2019-02-08 23:53:00', '2019-02-08 5:19:06', '2019-02-08 8:42:28',
       '2019-02-09 10:31:04', '2019-02-09 13:24:46',
       '2019-02-09 19:17:07', '2019-02-09 2:13:55', '2019-02-09 23:20:21',
       '2019-02-09 23:47:43', '2019-02-09 3:03:39', '2019-02-09 4:04:18',
       '2019-02-09 4:25:35', '2019-02-09 6:20:03', '2019-02-10 10:20:58',
       '2019-02-10 11:09:24', '2019-02-10 12:30:22',
       '2019-02-10 15:21:52', '2019-02-10 15:29:22',
       '2019-02-10 16:01:45', '2019-02-10 17:29:12',
       '2019-02-10 17:53:37', '2019-02-10 19:10:29',
       '2019-02-10 19:12:33', '2019-02-10 20:23:10',
       '2019-02-10 21:31:10', '2019-02-10 23:13:48', '2019-02-10 5:24:36',
       '2019-02-10 5:33:25', '2019-02-10 8:40:42', '2019-02-11 17:05:25',
       '2019-02-11 18:20:26', '2019-02-11 18:48:39', '2019-02-11 2:35:29',
       '2019-02-11 23:58:24', '2019-02-11 3:20:04', '2019-02-11 3:30:08',
       '2019-02-11 7:18:37', '2019-02-12 11:02:10', '2019-02-12 12:02:03',
       '2019-02-12 13:14:29', '2019-02-12 15:09:38',
       '2019-02-12 16:54:00', '2019-02-12 2:33:27', '2019-02-12 4:02:45',
       '2019-02-12 5:16:35', '2019-02-12 6:19:29', '2019-02-13 1:19:34',
       '2019-02-13 10:04:39', '2019-02-13 11:06:21',
       '2019-02-13 12:43:02', '2019-02-13 13:51:30',
       '2019-02-13 15:07:38', '2019-02-13 15:22:49',
       '2019-02-13 19:58:10', '2019-02-13 20:05:00',
       '2019-02-13 21:42:31', '2019-02-13 21:51:31',
       '2019-02-13 22:37:59', '2019-02-13 3:34:33', '2019-02-13 5:19:24',
       '2019-02-13 6:50:18', '2019-02-13 7:42:18', '2019-02-13 8:16:07',
       '2019-02-13 8:30:41', '2019-02-13 9:54:00', '2019-02-14 0:18:27',
       '2019-02-14 11:12:30', '2019-02-14 11:38:05',
       '2019-02-14 14:54:22', '2019-02-14 18:41:36', '2019-02-14 4:43:12',
       '2019-02-14 5:12:56', '2019-02-14 5:58:10', '2019-02-14 6:52:36',
       '2019-02-14 8:46:12', '2019-02-15 0:14:11', '2019-02-15 1:24:54',
       '2019-02-15 16:50:42', '2019-02-15 20:10:37',
       '2019-02-15 21:07:07', '2019-02-15 21:39:21',
       '2019-02-15 22:17:01', '2019-02-15 6:02:40', '2019-02-15 8:27:35',
       '2019-02-16 0:15:38', '2019-02-16 15:53:57', '2019-02-16 17:20:51',
       '2019-02-16 4:09:41', '2019-02-16 6:02:10', '2019-02-16 6:32:08',
       '2019-02-16 7:19:21', '2019-02-16 9:24:48', '2019-02-17 10:12:52',
       '2019-02-17 10:30:34', '2019-02-17 14:48:14',
       '2019-02-17 16:44:12', '2019-02-17 16:52:33', '2019-02-17 2:34:32',
       '2019-02-17 20:40:57', '2019-02-17 22:59:24',
       '2019-02-17 23:23:44', '2019-02-17 5:44:39', '2019-02-18 2:54:38',
       '2019-02-18 21:10:32', '2019-02-18 4:59:38', '2019-02-18 5:24:30',
       '2019-02-18 8:13:59', '2019-02-19 10:03:51', '2019-02-19 17:10:32',
       '2019-02-19 19:50:07', '2019-02-19 3:53:00', '2019-02-19 4:15:34',
       '2019-02-20 10:41:42', '2019-02-20 11:51:03',
       '2019-02-20 12:26:16', '2019-02-20 14:28:07',
       '2019-02-20 15:03:15', '2019-02-20 18:03:08',
       '2019-02-20 20:32:30', '2019-02-21 0:19:55', '2019-02-21 10:18:03',
       '2019-02-21 12:01:29', '2019-02-21 17:37:25',
       '2019-02-21 18:29:28', '2019-02-21 21:27:45', '2019-02-21 6:06:12',
       '2019-02-22 10:37:56', '2019-02-22 10:47:12',
       '2019-02-22 17:02:20', '2019-02-22 20:09:40',
       '2019-02-22 20:10:10', '2019-02-22 20:36:03',
       '2019-02-22 20:55:03', '2019-02-22 21:56:03', '2019-02-22 8:22:38',
       '2019-02-23 0:54:33', '2019-02-23 12:49:05', '2019-02-23 16:47:08',
       '2019-02-23 21:15:21', '2019-02-23 23:12:07', '2019-02-23 3:51:41',
       '2019-02-23 4:05:15', '2019-02-23 6:38:48', '2019-02-23 8:14:35',
       '2019-02-23 8:45:49', '2019-02-23 9:22:24', '2019-02-24 1:09:18',
       '2019-02-24 11:42:42', '2019-02-24 12:09:42',
       '2019-02-24 14:14:26', '2019-02-24 14:30:43',
       '2019-02-24 22:40:06', '2019-02-24 7:31:17', '2019-02-24 8:29:11',
       '2019-02-24 9:55:42', '2019-02-25 1:46:02', '2019-02-25 1:50:30',
       '2019-02-25 15:51:07', '2019-02-25 19:53:44',
       '2019-02-25 22:27:32', '2019-02-25 3:04:34', '2019-02-25 7:30:53',
       '2019-02-25 8:05:26', '2019-02-25 9:40:40', '2019-02-26 0:55:59',
       '2019-02-26 1:34:10', '2019-02-26 11:43:28', '2019-02-26 11:45:12',
       '2019-02-26 14:40:32', '2019-02-26 15:01:40',
       '2019-02-26 15:15:48', '2019-02-26 15:29:25',
       '2019-02-26 16:56:46', '2019-02-26 17:02:53',
       '2019-02-26 22:10:18', '2019-02-26 3:43:44', '2019-02-26 4:00:10',
       '2019-02-26 8:45:08', '2019-02-27 1:19:56', '2019-02-27 10:32:10',
       '2019-02-27 18:36:39', '2019-02-27 18:53:04',
       '2019-02-27 20:00:24', '2019-02-27 20:20:13',
       '2019-02-27 23:04:17', '2019-02-27 3:02:56', '2019-02-27 7:30:33',
       '2019-02-28 11:56:52', '2019-02-28 12:34:43',
       '2019-02-28 14:36:06', '2019-02-28 17:04:44',
       '2019-02-28 20:15:13', '2019-02-28 23:16:35',
       '2019-02-28 23:17:46', '2019-02-28 4:20:30', '2019-02-28 5:26:49',
       '2019-02-28 6:06:55', '2019-02-28 8:31:31', '2019-03-01 1:35:11',
       '2019-03-01 12:09:15', '2019-03-01 15:14:33',
       '2019-03-01 18:35:47', '2019-03-01 23:08:48',
       '2019-03-01 23:48:07', '2019-03-01 23:48:11', '2019-03-01 9:43:00',
       '2019-03-02 10:31:19', '2019-03-02 17:17:13',
       '2019-03-02 17:20:45', '2019-03-02 22:05:45', '2019-03-02 4:23:36',
       '2019-03-02 6:25:22', '2019-03-02 6:43:52', '2019-03-02 9:40:27',
       '2019-03-03 1:09:37', '2019-03-03 1:24:56', '2019-03-03 11:43:38',
       '2019-03-03 11:59:27', '2019-03-03 12:34:16',
       '2019-03-03 13:57:08', '2019-03-03 2:40:14', '2019-03-03 2:40:29',
       '2019-03-03 7:49:52', '2019-03-03 9:31:59', '2019-03-04 0:19:39',
       '2019-03-04 0:56:54', '2019-03-04 21:03:54', '2019-03-04 23:12:39',
       '2019-03-04 23:27:36', '2019-03-04 3:11:44', '2019-03-04 7:36:28',
       '2019-03-05 0:18:34', '2019-03-05 1:50:21', '2019-03-05 11:05:39',
       '2019-03-05 14:49:24', '2019-03-05 16:53:23',
       '2019-03-05 19:40:25', '2019-03-05 21:49:31',
       '2019-03-05 23:16:53', '2019-03-05 4:29:48', '2019-03-05 4:47:28',
       '2019-03-05 8:01:59', '2019-03-05 9:23:59', '2019-03-06 1:36:08',
       '2019-03-06 10:02:35', '2019-03-06 11:53:22',
       '2019-03-06 14:27:01', '2019-03-06 16:04:28',
       '2019-03-06 20:36:00', '2019-03-06 23:30:41', '2019-03-06 4:28:51',
       '2019-03-06 5:05:35', '2019-03-06 7:11:52', '2019-03-07 1:47:34',
       '2019-03-07 12:20:43', '2019-03-07 18:31:40',
       '2019-03-07 23:03:35', '2019-03-08 1:37:54', '2019-03-08 11:14:59',
       '2019-03-08 13:42:20', '2019-03-08 17:47:38',
       '2019-03-08 20:53:20', '2019-03-08 5:18:13', '2019-03-08 6:15:48',
       '2019-03-08 6:21:50', '2019-03-08 6:27:39', '2019-03-08 7:00:34',
       '2019-03-08 8:22:21', '2019-03-09 12:21:13', '2019-03-09 12:51:58',
       '2019-03-09 16:52:11', '2019-03-09 18:37:48',
       '2019-03-09 18:41:21', '2019-03-09 19:57:04',
       '2019-03-09 21:06:50', '2019-03-09 22:23:02', '2019-03-09 5:04:19',
       '2019-03-09 8:18:05', '2019-03-09 9:52:57', '2019-03-10 10:57:52',
       '2019-03-10 12:06:28', '2019-03-10 15:38:13',
       '2019-03-10 16:10:41', '2019-03-10 16:25:13',
       '2019-03-10 17:53:30', '2019-03-10 17:56:50',
       '2019-03-10 18:01:39', '2019-03-10 23:54:50', '2019-03-10 5:48:45',
       '2019-03-10 8:09:49', '2019-03-11 1:12:58', '2019-03-11 1:29:29',
       '2019-03-11 10:26:28', '2019-03-11 17:53:18',
       '2019-03-11 19:36:51', '2019-03-11 3:32:31', '2019-03-11 6:10:35',
       '2019-03-11 7:56:35', '2019-03-12 16:02:38', '2019-03-12 22:00:30',
       '2019-03-12 3:05:02', '2019-03-12 4:43:16', '2019-03-13 11:52:07',
       '2019-03-13 13:31:35', '2019-03-13 16:56:54',
       '2019-03-13 22:45:42', '2019-03-13 9:06:19', '2019-03-14 1:37:10',
       '2019-03-14 1:44:39', '2019-03-14 1:51:33', '2019-03-14 12:54:57',
       '2019-03-14 13:35:04', '2019-03-14 13:51:20', '2019-03-14 3:00:44',
       '2019-03-14 5:30:46', '2019-03-15 10:56:14', '2019-03-15 16:00:23',
       '2019-03-15 18:06:17', '2019-03-15 20:33:25',
       '2019-03-15 21:48:20', '2019-03-15 22:50:47', '2019-03-15 5:13:06',
       '2019-03-15 7:15:25', '2019-03-16 10:44:35', '2019-03-16 11:50:00',
       '2019-03-16 13:21:35', '2019-03-16 13:23:16',
       '2019-03-16 13:39:16', '2019-03-16 16:04:41',
       '2019-03-16 17:01:22', '2019-03-16 22:43:57',
       '2019-03-17 10:02:01', '2019-03-17 14:00:23',
       '2019-03-17 14:18:59', '2019-03-17 17:20:07',
       '2019-03-17 19:31:29', '2019-03-17 2:03:13', '2019-03-17 2:23:18',
       '2019-03-17 20:47:39', '2019-03-17 8:46:12', '2019-03-17 9:36:53',
       '2019-03-18 1:50:34', '2019-03-18 10:13:24', '2019-03-18 13:19:55',
       '2019-03-18 14:36:52', '2019-03-18 19:37:29', '2019-03-18 4:21:14',
       '2019-03-19 0:25:45', '2019-03-19 2:19:00', '2019-03-19 23:38:48',
       '2019-03-19 23:44:53', '2019-03-19 3:01:21', '2019-03-19 3:49:50',
       '2019-03-19 5:49:22', '2019-03-19 6:42:22', '2019-03-19 8:06:57',
       '2019-03-20 1:03:45', '2019-03-20 12:22:06', '2019-03-20 14:04:43',
       '2019-03-20 15:01:50', '2019-03-20 17:17:17',
       '2019-03-20 18:56:58', '2019-03-20 19:53:21', '2019-03-20 2:43:48',
       '2019-03-20 20:07:58', '2019-03-20 22:08:11',
       '2019-03-20 23:55:10', '2019-03-20 3:40:16', '2019-03-20 8:48:22',
       '2019-03-21 0:33:37', '2019-03-21 1:24:09', '2019-03-21 1:28:20',
       '2019-03-21 11:52:36', '2019-03-21 12:54:43',
       '2019-03-21 17:35:31', '2019-03-21 18:53:28', '2019-03-21 4:38:31',
       '2019-03-21 6:17:31', '2019-03-21 7:22:31', '2019-03-22 1:21:35',
       '2019-03-22 17:37:24', '2019-03-22 19:02:28', '2019-03-22 2:32:21',
       '2019-03-22 2:34:01', '2019-03-22 3:27:39', '2019-03-22 4:14:12',
       '2019-03-22 7:57:08', '2019-03-23 10:05:07', '2019-03-23 14:28:04',
       '2019-03-23 16:27:03', '2019-03-23 17:48:11',
       '2019-03-23 23:38:27', '2019-03-23 23:47:07', '2019-03-23 3:18:55',
       '2019-03-23 4:24:59', '2019-03-23 6:14:18', '2019-03-24 0:57:08',
       '2019-03-24 11:02:31', '2019-03-24 15:29:06', '2019-03-24 2:52:39',
       '2019-03-24 22:17:31', '2019-03-24 22:38:56', '2019-03-25 0:21:03',
       '2019-03-25 0:27:33', '2019-03-25 21:47:43', '2019-03-25 21:57:48',
       '2019-03-25 23:09:25', '2019-03-25 4:34:52', '2019-03-25 6:45:43',
       '2019-03-25 8:50:07', '2019-03-25 9:07:15', '2019-03-25 9:48:33',
       '2019-03-25 9:58:13', '2019-03-26 10:41:36', '2019-03-26 21:08:06',
       '2019-03-26 23:59:35', '2019-03-26 5:16:44', '2019-03-26 6:53:51',
       '2019-03-26 7:54:46', '2019-03-26 8:29:07', '2019-03-27 10:25:17',
       '2019-03-27 10:36:28', '2019-03-27 10:46:22',
       '2019-03-27 11:11:06', '2019-03-27 12:18:24',
       '2019-03-27 13:26:11', '2019-03-27 14:20:24',
       '2019-03-27 14:31:30', '2019-03-27 19:56:51', '2019-03-27 2:25:52',
       '2019-03-27 22:47:37', '2019-03-27 3:39:36', '2019-03-27 9:36:20',
       '2019-03-28 17:18:58', '2019-03-28 18:27:32', '2019-03-28 2:22:04',
       '2019-03-28 20:54:43', '2019-03-28 22:02:21', '2019-03-28 6:34:25',

In [276]:
# Соединим всё, что мы делали, и очистим файл log.csv. А именно:

# прочитаем файл в переменную log;
# добавим названия колонок user_id, time, bet, win;
# удалим строки, которые содержат значения user_id с ошибками;
# оставим в user_id только значения идентификатора;
# уберём начальную скобку из поля time.
import pandas as pd 
import re

log = pd.read_csv("datasets/python-8/log.csv", header=None)
log.columns = ['user_id','time','bet','win']


log = log[~log.user_id.str.contains('error')]
# log.user_id = log.user_id.apply(lambda s: re.search(r'[0-9]+', s).group())
log.user_id = log.user_id.apply(lambda s: str(s).split()[-1])
log.time = log.time.str.replace('[', '')
log

      user_id                 time      bet     win
0    user_919  2019-01-01 14:06:51      NaN     NaN
1    user_973  2019-01-01 14:51:16      NaN     NaN
2    user_903  2019-01-01 16:31:16      NaN     NaN
3    user_954  2019-01-01 17:17:51      NaN     NaN
4    user_954  2019-01-01 21:31:18      NaN     NaN
..        ...                  ...      ...     ...
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]